In [1]:
import pandas as pd
import numpy as np

In [30]:
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [3]:
def add_4(x):
    return x+4

In [4]:
df['B']=df['B'].apply(add_4)

df

   A   B  C
0  3   9  7
1  2   8  6
2  5  12  9

In [5]:
# adding the value to all the columns using "Apply" to all the columns

df2 = df.apply(add_4)

df2

   A   B   C
0  7  13  11
1  6  12  10
2  9  16  13

In [6]:
def mult_3 (x):
    return x*3

In [7]:
df3 = df.apply(mult_3)

df3

    A   B   C
0   9  27  21
1   6  24  18
2  15  36  27

In [26]:
# Row adding 
df['Sum']=df.apply(sum,axis=1)

df

   A  B  C  Sum
0  3  5  7   15
1  2  4  6   12
2  5  8  9   22

In [27]:
# Finding Minimum value
df['Min'] = df.apply(min,axis=1)

df

   A  B  C  Sum  Min
0  3  5  7   15    3
1  2  4  6   12    2
2  5  8  9   22    5

In [28]:
df['Max'] = df[['A','B','C']].apply(max,axis=1)

df

   A  B  C  Sum  Min  Max
0  3  5  7   15    3    7
1  2  4  6   12    2    6
2  5  8  9   22    5    9

In [29]:
# Lambda Function

df[['A','B','C']] = df[['A','B','C']].apply(lambda x : x * 2)

df

    A   B   C  Sum  Min  Max
0   6  10  14   15    3    7
1   4   8  12   12    2    6
2  10  16  18   22    5    9

In [45]:
data = [(3,5,7), (2,4,6),(5,8,9)]
df = pd.DataFrame(data, columns = ['A','B','C'])
print(df)

   A  B  C
0  3  5  7
1  2  4  6
2  5  8  9

In [33]:
def add2 (x):
    return x + 2

In [35]:
# with transform() function the resulting DataFrame must have the same length as the input DataFrame

df4 = df.transform(add2)
# df
df4

   A   B   C
0  5   7   9
1  4   6   8
2  7  10  11

In [36]:
# Using pandas.DataFrame.map() to Single Column

df['ADivided2'] = df['A'].map(lambda x : x/2)

df

   A  B  C  ADivided2
0  3  5  7        1.5
1  2  4  6        1.0
2  5  8  9        2.5

In [ ]:
# DataFrame.assign() to Apply Lambda Function

# Dataframe.assign() method assign new columns to a DataFrame, returning a new object (a copy) 
# with the new columns added to the original ones. Existing columns that are re-assigned will be overwritten

In [40]:
df = df.assign(NewB = lambda x : df['B']+ df['B']/2)

df

   A  B  C  ADivided2  NewB
0  3  5  7        1.5   7.5
1  2  4  6        1.0   6.0
2  5  8  9        2.5  12.0

In [41]:
df_new1 = df.assign(NewC = lambda x : df['C']*2 ,
                    NewA = lambda x : df['A']/2)

df_new1

   A  B  C  ADivided2  NewB  NewC  NewA
0  3  5  7        1.5   7.5    14   1.5
1  2  4  6        1.0   6.0    12   1.0
2  5  8  9        2.5  12.0    18   2.5

In [49]:
# Using Numpy function on single Column

columns_ = list(df.columns.values)

df[columns_] = df[columns_].apply(np.square)

df

    A   B   C  numpySquare_A
0   9  25  49             81
1   4  16  36             16
2  25  64  81            625

In [50]:
# Multiple columns Using NumPy.square() and Lambda Function

dfnewA_B= df.apply(lambda x : np.square(x) if x.name in ['A','C'] else x)

dfnewA_B

     A   B     C  numpySquare_A
0   81  25  2401             81
1   16  16  1296             16
2  625  64  6561            625

In [51]:
def add3(x):
    return x+3

In [53]:
dfnewCA = df.apply(lambda x : add3(x) if x.name in ['A','C'] else x)

dfnewCA

    A   B   C  numpySquare_A
0  12  25  52             81
1   7  16  39             16
2  28  64  84            625